000100 IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Rui Vilela.
       DATE-WRITTEN.  31/03/2024.
       PROCEDURE DIVISION.
           DISPLAY "Hello World!".
           STOP RUN.
           