000100 IDENTIFICATION DIVISION.
       PROGRAM-ID. HelloWorld.
       AUTHOR. Rui Vilela.
       DATE-WRITTEN.  15/04/2024.
       PROCEDURE DIVISION.
           DISPLAY "Hello World!".
           STOP RUN.
